<div class="container disclamer">
    <div class="row">
        <div class="col-md-12">
            <div>18+</div>
            <div>
                <p> Мы <strong>не несём ответственность</strong> за Ваши действия и <strong>не призываем</strong>
                    Вас к каким-либо действиям! Отвественность за рекламируемые каналом проекты несём не мы, а
                    создатель этих самых проектов, ну а за участие в них отвечаете вы и за свои деньги отвечаете
                    тоже вы! Любые материалы взяты из открытых источников и используются в добросовестных целях.
                    Ещё, возможно, в видео содержаться вымышленные персонажи, ситуации и моменты, любые сходства с
                    реальностью случайны. </p>
                <p>Не рекомендуется к просмотру лицам, <strong>не достигшим 18 лет</strong>.</p>
            </div>
        </div>
    </div>
    <div class="row">
        <div class="col-md-12"></div>
    </div>
</div>
<div class="container">
    <div class="row">
        <div class="col-md-12"></div>
    </div>
</div>