<div class="container">
    <div class="row index_text">
        <div class="col-md-6">
            <div>
                <h2>ДЛЯ ЧЕГО НУЖЕН САЙТ<br>С ОБЗОРАМИ КАЗИНО</h2>
                <p><strong>Онлайн-казино</strong> – направление, которое приобрело несомненную популярность и стало
                    достойной альтернативой офлайн-играм. </p>
                <p> Не придется <strong>никуда</strong> ехать, если хотите заглянуть в заведение, работающее в
                    режиме онлайн, не придется вкладывать лишние средства в соответствующую одежду, машину,
                    достаточно просто компьютера или мобильного телефона с подключением к интернету. </p>
                <p> Сайт <strong>поможет выбрать</strong> подходящие казино, где выигрыши будут реальными и
                    достойными, где вы не попадетесь мошенникам и обязательно сможете вывести деньги с депозита.
                </p><i></i><u></u>
            </div>
            <div class="niz"></div>
        </div>
        <div class="col-md-6">
            <div>
                <h2>Немного <br>О НАС</h2>
                <p> На нашем сайте <strong>мы публикуем новинки онлайн-казино</strong>. Все время появляются
                    заведения, которые пытаются потеснить уже известные и неоднократно заявившие о себе, предлагают
                    на первых порах выгодные условия для игры, поскольку на этапе раскрутки новинкам нужно привлечь
                    как можно больше посетителей и обеспечить их лояльность. <a href="javascript:;" class="moreinfo"
                        data-bs-toggle="modal" data-bs-target="#text0009"><span
                            class="btn_flare"><i></i></span>Подробнее</a></p>
                <p><strong>Лайв дилеры – что это?</strong><br> Игра в онлайн-казино – это не только слоты,
                    аналогичные знаменитому автомату «Однорукий пират», только в виртуальной реальности. Современные
                    технологии видео предлагают полную имитацию «живого» казино. <a href="javascript:;" class="moreinfo"
                        data-bs-toggle="modal" data-bs-target="#text00010"><span
                            class="btn_flare"><i></i></span>Подробнее</a></p><i></i><u></u>
            </div>
            <div class="niz"></div>
        </div>
    </div>
</div>


<div class="modal fade" tabindex="-1" id="text0009">
    <div class="modal-dialog modal-dialog-centered">
        <div class="modal-content"><button type="button" class="close" data-bs-dismiss="modal" aria-label="Close"><span
                    aria-hidden="true">×</span></button>
            <div class="modal-body">
                <div class="container">
                    <div class="row">
                        <div class="col-md-12">
                            <p> На нашем сайте <strong>мы публикуем новинки онлайн-казино</strong>. Все время
                                появляются заведения, которые пытаются потеснить уже известные и неоднократно
                                заявившие о себе, предлагают на первых порах выгодные условия для игры, поскольку на
                                этапе раскрутки новинкам нужно привлечь как можно больше посетителей и обеспечить их
                                лояльность </p>
                            <p> Ставя то или иное новое или уже известное заведение в обзор, мы обязательно обращаем
                                внимание на <strong>наличие лицензии</strong>. Это документ, подтверждающий
                                легальность заведения. О нем следует знать: </p>
                            <ul>
                                <li><strong>Лицензию выдают</strong> некоторые государства, которые предлагают ту
                                    или иную налоговую ставку. </li>
                                <li> Физически сервера казино <strong>могут находиться где угодно</strong>, но
                                    юридически принадлежат одному из мест, где допускается регистрация азартных игр.
                                </li>
                                <li> Наиболее выгодные для игрока лицензии онлайн-заведений – это Канаваке (Канада),
                                    <strong>Кюрасао</strong>, Мальта. Это означает, что заведение несет всю
                                    ответственность (если лицензия мальтийская, то вообще подчиняется крайне строгим
                                    законам Великобритании об азартных играх).
                                </li>
                            </ul>
                            <p> Мошенники <strong>подделывают лицензии</strong>, поэтому доверять самому документу
                                на сайте можно не всегда. Здесь вновь <strong>помогает сайт обзоров</strong>,
                                который проверяет, действительно ли лицензирование соответствует истине.
                                Дополнительно стоит обращать внимание на лицензию на пользование игровым софтом,
                                поскольку это означает, что все программы не взломанные и показывают результаты
                                действительно в зависимости от случайных чисел. </p><a href="javascript:;"
                                class="force-close"><span>Понятно</span></a>
                        </div>
                    </div>
                </div><i class="iu1"></i><i class="iu2"></i>
            </div>
        </div>
    </div>
</div>
<div class="modal fade" tabindex="-1" id="text00010">
    <div class="modal-dialog modal-dialog-centered">
        <div class="modal-content"><button type="button" class="close" data-bs-dismiss="modal" aria-label="Close"><span
                    aria-hidden="true">×</span></button>
            <div class="modal-body">
                <div class="container">
                    <div class="row">
                        <div class="col-md-12">
                            <p> Игра в онлайн-казино – это <strong>не только слоты</strong>, аналогичные знаменитому
                                автомату Однорукий пират, только в виртуальной реальности. </p>
                            <p> Современные технологии видео предлагают полную имитацию живого казино. Это
                                называется <strong>Лайв дилеры</strong> ситуация, когда вы играете не против
                                компьютерной системы или программ, а с живыми дилерами, которые раздают карты,
                                комментируют происходящее на игорном столе – все как в жизни. </p>
                            <p> Многим нравится игра именно с лайв дилерами, ведь это добавляет пресловутый
                                <strong>человеческий фактор</strong> – эмоциональность, элементы <strong>живого
                                    общения</strong>. Дополнительно в некоторых играх можно играть против других
                                игроков, которые также ставят против крупье.
                            </p>
                            <p><strong>Эта технология позволяет</strong> совместить все преимущества виртуальной
                                реальности онлайн-казино с ощущением полного погружения. </p>
                            <p><strong>Мы производим</strong> обзоры слотов, заведений, лайв дилеров. Вы всегда
                                будете в курсе новинок и сможете поиграть в самых лучших заведениях, предлагающих
                                самые выгодные условия. </p><a href="javascript:;"
                                class="force-close"><span>Понятно</span></a>
                        </div>
                    </div>
                </div><i class="iu1"></i><i class="iu2"></i>
            </div>
        </div>
    </div>
</div>