<div class="row text">
    <div class="col-md-12">
        <p>Полное или частичное копирование материалов возможно только с письменного разрешения редакции.</p>
        <p>Любой контент, размещаемый на страницах сайта Ludobzor, регулярно обновляется и поддерживается в
            актуальном состоянии. Пользуйтесь только проверенными источниками информации.</p>
        <p>Сайт Ludobzor носит исключительно информационный характер и не принимает денежных платежей со стороны
            пользователей.</p>
        <p>Азартные игры должны расцениваться как развлечение, а не как способ заработка. Чрезмерное увлечение
            может привести к стремительному развитию <a href="/borba-s-ludomaniej/"
                rel="nofollow noreferrer noopener">игровой зависимости</a>, играйте <a href="/otvetstvennaya-igra/"
                rel="nofollow noreferrer noopener">ответственно</a>. </p>
    </div>
</div>