<?php
$post_type = $args_data['post_type'];

// Настраиваем запрос для получения постов указанного типа
$query = new WP_Query([
    'post_type' => $post_type,
    'posts_per_page' => -1, // Получаем все посты (можно ограничить, если нужно)
]);


// Проверяем, есть ли посты
if ($query->have_posts()) :
?>
    <div class="sidebar-info col-lg-4">
        <input type="checkbox" name="show__sidebar" id="show__sidebar" value="1">
        <div class="sidebar-info--wrapper">
            <div class="tourn-item">
                <div class="widget-title"><span>ТУРНИРЫ</span></div>
                <div class="tourn-item-group">
                    <?php 
                    // Выводим каждый пост
                    while ($query->have_posts()) : $query->the_post();
                        $img = get_field('photo');
                        $title = get_the_title();
                        $days = get_field('prodolzhitelnost_turnira');
                        $txt = get_field('usloviya');
                        $promo = get_field('promo');
                        $prize = get_field('prizovoj_fond');
                        $winners = get_field('kolichestvo_pobeditelej');
                    ?>
                        <div class="tourn-item-inner">
                            <div class="tourn-item-title">Завершенные турниры</div>
                            <div class="tourn-item-logo">
                                <img src="<?php echo esc_url($img); ?>" alt="<?php echo esc_attr($title); ?>">
                                <div class="tourn-item-caption">Продолжительность турнира: <span><?php echo esc_html($days); ?></span></div>
                            </div>
                            <ul class="tourn-item-list">
                                <li><span>Условия:</span> <?php echo esc_html($txt); ?></li>
                                <li>
                                    <span>По промокоду:</span>
                                    <button class="copy-btn">
                                    <svg width="13" height="13" viewBox="0 0 13 13" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M2.8966 0.0333776C2.41094 0.164638 2.00465 0.580704 1.89092 1.06324C1.81262 1.39548 1.86203 1.6235 2.04212 1.76086C2.218 1.89504 2.52234 1.86747 2.6702 1.70397C2.73322 1.63424 2.79176 1.48169 2.79239 1.38539C2.79323 1.26015 2.87615 1.10181 2.98397 1.01956L3.08002 0.946282L7.37534 0.938812C10.3254 0.933654 11.6996 0.939701 11.7631 0.958046C11.8783 0.991306 12.031 1.15606 12.0512 1.26872C12.0595 1.31499 12.063 3.28031 12.059 5.63615L12.0517 9.91947L11.9785 10.0155C11.8962 10.1234 11.7379 10.2063 11.6127 10.2071C11.3359 10.209 11.1344 10.4338 11.1549 10.7178C11.1869 11.1596 11.6986 11.28 12.2695 10.9799C12.6052 10.8035 12.9021 10.4134 12.9774 10.05C12.9971 9.95471 13.0032 8.62689 12.9984 5.49442L12.9917 1.07333L12.9211 0.895059C12.7778 0.533317 12.4646 0.22008 12.1029 0.0767755L11.9247 0.00616504L7.47894 0.001312C3.65985 -0.002855 3.01392 0.00164231 2.8966 0.0333776ZM1.08974 2.34535C0.998919 2.36497 0.850303 2.41838 0.759483 2.46401C0.549033 2.56981 0.264732 2.8489 0.157247 3.05519C-0.0141568 3.38426 -0.0040967 3.07926 0.00332138 7.72275L0.0100535 11.9228L0.0806523 12.1011C0.223933 12.4628 0.537118 12.776 0.8988 12.9193L1.07704 12.9899L5.27638 12.9967C9.91911 13.0041 9.61415 13.0142 9.94316 12.8427C10.1497 12.7351 10.4285 12.4509 10.5341 12.2404C10.6993 11.911 10.6917 12.1302 10.6922 7.66517C10.6924 4.89729 10.684 3.56298 10.6654 3.46005C10.6211 3.21377 10.4593 2.90988 10.2739 2.7244C10.0885 2.53894 9.78462 2.37717 9.53837 2.3328C9.4352 2.3142 8.10435 2.30628 5.32124 2.30765C1.93159 2.30935 1.22738 2.31563 1.08974 2.34535ZM9.40909 3.27409C9.54124 3.31078 9.6893 3.46056 9.72517 3.59383C9.74544 3.66917 9.75152 4.83219 9.74666 7.72366L9.73993 11.7486L9.66839 11.8568C9.62337 11.9248 9.55742 11.9828 9.49056 12.0132C9.3876 12.0599 9.25809 12.0614 5.34027 12.062C2.54348 12.0624 1.27423 12.0542 1.22476 12.0355C1.12744 11.9987 1.01459 11.8891 0.972295 11.7902C0.94308 11.7219 0.937415 11.0423 0.937872 7.66131C0.938406 3.76943 0.940235 3.61019 0.985709 3.51003C1.03786 3.39516 1.15424 3.29922 1.27684 3.26997C1.41189 3.23773 9.29258 3.24174 9.40909 3.27409Z"
                                            fill="white"></path>
                                    </svg>
                                    </button>
                                    <?php echo esc_html($promo); ?>
                                </li>
                                <li><span>Призовой фонд:</span> <?php echo esc_html($prize); ?></li>
                                <li><span>Количество победителей:</span> <?php echo esc_html($winners); ?></li>
                            </ul>
                        </div>
                    <?php endwhile; ?>
                </div>
            </div>
        </div>
    </div>
<?php
// Если постов нет, можно добавить сообщение
else :
    echo '<p>Турниры не найдены.</p>';
endif;

// Восстанавливаем глобальную переменную поста
wp_reset_postdata();
?>